# HasMiddleSupports Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StairsType..::..HasMiddleSupports Property
StairsType Class See Also
---
True if the stairs type has middle supports, False otherwise.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool HasMiddleSupports { get; set; }
```

Visual Basic
---
```text
Public Property HasMiddleSupports As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool HasMiddleSupports {
	bool get ();
	void set (bool value);
}
```

# See Also
StairsType Class
Autodesk.Revit.DB.Architecture Namespace